clear;     
clc;        
% L1~L3 对应前三个转动关节之间的刚性连杆；
% L4 为第四个移动关节 Slider 的物理长度。
L1 = 0.50;      % Link 1 长度，单位：m
L2 = 0.40;      % Link 2 长度，单位：m
L3 = 0.30;      % Link 3 长度，单位：m
L4 = 0.25;      % P4 滑块物理长度，单位：m

% W 和 H 分别表示连杆截面的宽度与高度。矩形截面。
W = 0.05;       % 连杆截面宽度，单位：m
H = 0.05;       % 连杆截面高度，单位：m

% m1~m3 对应前三根连杆，m4 对应 P4 的 Slider。
m1 = 2.0;       % Link 1 质量，单位：kg
m2 = 1.5;       % Link 2 质量，单位：kg
m3 = 1.0;       % Link 3 质量，单位：kg
m4 = 0.8;       % P4 Slider 质量，单位：kg

% Link1~Link3 的体积为 Li*W*H；Slider 的体积为 W*W*L4。
rho1 = m1/(L1*W*H);     % Link 1 密度，单位：kg/m^3
rho2 = m2/(L2*W*H);     % Link 2 密度，单位：kg/m^3
rho3 = m3/(L3*W*H);     % Link 3 密度，单位：kg/m^3
rho4 = m4/(W*W*L4);     % P4 Slider 密度，单位：kg/m^3

% q1~q3 为转动关节角度（rad），d4 为移动关节位移（m）。
q1_0 = deg2rad(0);      % R1 初始角度：0 deg
q2_0 = deg2rad(0);      % R2 初始角度：0 deg
q3_0 = deg2rad(0);      % R3 初始角度：0 deg
d4_0 = 0;               % P4 初始位移：0 m
q1_f = deg2rad(45);     % R1 目标角度
q2_f = deg2rad(-30);    % R2 目标角度
q3_f = deg2rad(60);     % R3 目标角度
d4_f = -0.15;           % P4 目标位移

% 当前运动编排：
%   R1：0.5 s 开始，运动 3.0 s
%   R2：1.0 s 开始，运动 3.0 s
%   R3：1.5 s 开始，运动 3.0 s
%   P4：2.0 s 开始，运动 3.0 s
 ts1 = 0.5;             % R1 轨迹开始时间，单位：s
 ts2 = 1.0;             % R2 轨迹开始时间，单位：s
 ts3 = 1.5;             % R3 轨迹开始时间，单位：s
 ts4 = 2.0;             % P4 轨迹开始时间，单位：s
 T1 = 3.0;              % R1 轨迹持续时间，单位：s
 T2 = 3.0;              % R2 轨迹持续时间，单位：s
 T3 = 3.0;              % R3 轨迹持续时间，单位：s
 T4 = 3.0;              % P4 轨迹持续时间，单位：s

%PID gains
Kp1 = 30;          
Ki1 = 1;               
Kd1 = 8;               
Kp2 = 25;              
Ki2 = 1;                
Kd2 = 6;               
Kp3 = 20;             
Ki3 = 0.5;              
Kd3 = 5;                
Kp4 = 60;              
Ki4 = 0;                
Kd4 = 20;             
Tsim = 60;         
